In [1]:
import pandas as pd
import random

In [2]:
#Hasta 15 de Abril (para entrenar)

postulantes_edu_df = pd.read_csv('fiuba_1_postulantes_educacion_h15.csv')
postulantes_gye_df = pd.read_csv('fiuba_2_postulantes_genero_y_edad_h15.csv')
vistas_df = pd.read_csv('fiuba_3_vistas_h15.csv')
postulaciones_df = pd.read_csv('fiuba_4_postulaciones_h15.csv')
avisos_online_df = pd.read_csv('fiuba_5_avisos_online_h15.csv')
avisos_detalle_df = pd.read_csv('fiuba_6_avisos_detalle_h15.csv')

In [ ]:
#Originales TP1 (para entrenar)

postulantes_edu_df2 = pd.read_csv('fiuba_1_postulantes_educacion.csv')
postulantes_gye_df2 = pd.read_csv('fiuba_2_postulantes_genero_y_edad.csv')
vistas_df2 = pd.read_csv('fiuba_3_vistas.csv')
postulaciones_df2 = pd.read_csv('fiuba_4_postulaciones.csv')
avisos_online_df2 = pd.read_csv('fiuba_5_avisos_online.csv')
avisos_detalle_df2 = pd.read_csv('fiuba_6_avisos_detalle.csv')

In [ ]:
#Realizo el Merge del tipo outer de los datos
#Originales TP1 y Datos hasta 15 de abril

postulantes_edu_df = postulantes_edu_df.merge(postulantes_edu_df2,how='outer')
postulantes_gye_df = postulantes_gye_df.merge(postulantes_gye_df2,how='outer')
vistas_df = vistas_df.merge(vistas_df2,how='outer')
postulaciones_df = postulaciones_df.merge(postulaciones_df2,how='outer')
avisos_online_df = avisos_online_df.merge(avisos_online_df2,how='outer')
avisos_detalle_df = avisos_detalle_df.merge(avisos_detalle_df2,how='outer')

In [ ]:
#Desde 15 de abril (para entrenar)

postulantes_edu_df2 = pd.read_csv('fiuba_1_postulantes_educacion_d15.csv')
postulantes_gye_df2 = pd.read_csv('fiuba_2_postulantes_genero_y_edad_d15.csv')
vistas_df2 = pd.read_csv('fiuba_3_vistas_d15.csv')
avisos_detalle_df2 = pd.read_csv('fiuba_6_avisos_detalle_d15.csv')

In [ ]:
#Avisos detalle que faltaban
avisos_detalle_missing = pd.read_csv('fiuba_6_avisos_detalle_missing_nivel_laboral.csv')

In [ ]:
#Mergeamos todo

postulantes_edu_df = postulantes_edu_df.merge(postulantes_edu_df2,how='outer')
postulantes_gye_df = postulantes_gye_df.merge(postulantes_gye_df2,how='outer')
vistas_df = vistas_df.merge(vistas_df2,how='outer')
avisos_detalle_df = avisos_detalle_df.merge(avisos_detalle_df2,how='outer')
avisos_detalle_df = avisos_detalle_df.merge(avisos_detalle_missing,how='outer')

In [ ]:
postulantes_edu_df.head()

In [ ]:
postulantes_gye_df.head()

In [ ]:
vistas_df.head()

In [ ]:
avisos_detalle_df.head()

In [ ]:
test_final_df = pd.read_csv(r'C:\Users\Andres\Documents\TP2 Datos\test_final_100k.csv')

In [ ]:
test_final_df.head()

In [ ]:
test_final_df.idaviso.unique().shape

In [ ]:
test_final_df.idpostulante.unique().shape

In [ ]:
print(postulantes_edu_df.shape)
print(postulantes_gye_df.shape)

In [ ]:
print(postulantes_edu_df.idpostulante.unique().shape)
print(postulantes_gye_df.idpostulante.unique().shape)

In [ ]:
#Sacamos los repetidos de postualntes_gye

postulantes_gye_df = postulantes_gye_df.drop_duplicates('idpostulante')
postulantes_gye_df.shape

In [ ]:
test_final_df.drop_duplicates('idpostulante').merge(postulantes_gye_df,on='idpostulante',how='inner').shape

In [ ]:
#Sacamos los repetidos de avisos_detalle

avisos_detalle_df = avisos_detalle_df.drop_duplicates('idaviso')

In [ ]:
test_final_df.drop_duplicates('idaviso').merge(avisos_detalle_df,on='idaviso',how='inner').shape

In [ ]:
#Comparamos los postulantes con las postulaciones

print(postulantes_gye_df.idpostulante.unique().shape)
print(postulaciones_df.idpostulante.unique().shape)

In [21]:
merge = postulaciones_df.merge(postulantes_gye_df,on='idpostulante',how='inner')
merge.idpostulante.unique().shape

(348883,)

In [22]:
merge = merge.drop_duplicates('idpostulante')
merge.shape

(348883, 5)

In [23]:
print(postulantes_gye_df.columns)
print(merge.columns)

Index(['idpostulante', 'fechanacimiento', 'sexo'], dtype='object')
Index(['idaviso', 'idpostulante', 'fechapostulacion', 'fechanacimiento',
       'sexo'],
      dtype='object')

In [24]:
merge =  merge.drop(['idaviso','fechapostulacion'],axis='columns')
merge = merge.reset_index()
merge.head()

   index idpostulante fechanacimiento  sexo
0      0         NjlD      1981-06-02   FEM
1      1         ZaO5      1978-08-10   FEM
2     92         NdJl      1969-05-09  MASC
3    122         5kNq      1973-02-08  MASC
4    132         Ez8J      1968-12-18  MASC

In [25]:
merge =  merge.drop('index',axis='columns')
merge.head()

  idpostulante fechanacimiento  sexo
0         NjlD      1981-06-02   FEM
1         ZaO5      1978-08-10   FEM
2         NdJl      1969-05-09  MASC
3         5kNq      1973-02-08  MASC
4         Ez8J      1968-12-18  MASC

In [26]:
postulantes_gye_df.head()

  idpostulante fechanacimiento        sexo
0          6MM      1985-01-01        MASC
1          Nzz             NaN  NO_DECLARA
2          ZX1             NaN  NO_DECLARA
3          Nq5             NaN  NO_DECLARA
4          ebE      1952-07-07        MASC

In [27]:
postulantes_gye_df = merge
postulantes_gye_df.head()

  idpostulante fechanacimiento  sexo
0         NjlD      1981-06-02   FEM
1         ZaO5      1978-08-10   FEM
2         NdJl      1969-05-09  MASC
3         5kNq      1973-02-08  MASC
4         Ez8J      1968-12-18  MASC

In [28]:
postulantes_gye_df.shape

(348883, 3)

In [29]:
avisos_online_df.drop_duplicates('idaviso').merge(test_final_df.drop_duplicates('idaviso'),on='idaviso',how='inner').shape

(6166, 3)

# Aca Empieza Lo Agregado

In [44]:
grouped=postulaciones_df.groupby('idpostulante').agg({'idaviso':'value_counts'})
grouped.columns=['postulacion']
grouped['postulacion'] = 1 #Para los casos en que se repiten.

In [31]:
grouped.head()

                         postulacion
idpostulante idaviso
0z5Dmrd      1112384041            1
             1112420060            1
0z5JW1r      1112257171            1
             1112281879            1
             1112292169            1

In [50]:
grouped.reset_index(inplace=True)

In [35]:
#Cambio la lista de postulantes por la obtenida en la primer parte
lista = []
user_list = postulantes_gye_df['idpostulante'].unique() #Aca.
aviso_list = avisos_detalle_df['idaviso'].unique() #Quedaria hacer lo mismo con los avisos
index = 1
for n in range(10000):
    for i in range(500):
        user_index = random.randint(0,348000)
        aviso_index = random.randint(0,19000)
        lista.append((index,user_list[user_index],aviso_list[aviso_index],0))
        index+=1

In [36]:
postulaciones_df['idaviso'].value_counts().count()

20231

In [37]:
df = pd.DataFrame(lista)

In [38]:
df.head()

   0        1           2  3
0  1  zva5Ab5  1112258306  0
1  2  QNMDZQN  1112395254  0
2  3  W9OXNNN  1112377039  0
3  4   N8oWeM  1112354042  0
4  5  vVDae8Q  1112457811  0

In [39]:
df.drop(0,axis='columns',inplace=True)

In [40]:
df.head()

         1           2  3
0  zva5Ab5  1112258306  0
1  QNMDZQN  1112395254  0
2  W9OXNNN  1112377039  0
3   N8oWeM  1112354042  0
4  vVDae8Q  1112457811  0

In [41]:
df.columns= ['idpostulante','idaviso','postulacion']

In [49]:
df.head()

  idpostulante     idaviso  postulacion
0      zva5Ab5  1112258306            0
1      QNMDZQN  1112395254            0
2      W9OXNNN  1112377039            0
3       N8oWeM  1112354042            0
4      vVDae8Q  1112457811            0

In [48]:
grouped.head()

                         postulacion
idpostulante idaviso
0z5Dmrd      1112384041            1
             1112420060            1
0z5JW1r      1112257171            1
             1112281879            1
             1112292169            1

In [51]:
#Unificar los DF

df_1 = grouped.merge(df,how='outer',on=['idpostulante','idaviso'])

In [53]:
df_1.head()

  idpostulante     idaviso  postulacion_x  postulacion_y
0      0z5Dmrd  1112384041            1.0            NaN
1      0z5Dmrd  1112420060            1.0            NaN
2      0z5JW1r  1112257171            1.0            NaN
3      0z5JW1r  1112281879            1.0            NaN
4      0z5JW1r  1112292169            1.0            NaN

In [54]:
df_1['postulacion_x'].fillna(0,inplace=True)
df_1['postulacion_y'].fillna(0,inplace=True)

In [55]:
df_1['postulacion'] = df_1['postulacion_x'] + df_1['postulacion_y']

In [56]:
df_1.head()

  idpostulante     idaviso  postulacion_x  postulacion_y  postulacion
0      0z5Dmrd  1112384041            1.0            0.0          1.0
1      0z5Dmrd  1112420060            1.0            0.0          1.0
2      0z5JW1r  1112257171            1.0            0.0          1.0
3      0z5JW1r  1112281879            1.0            0.0          1.0
4      0z5JW1r  1112292169            1.0            0.0          1.0

In [57]:
 df_1.drop(['postulacion_x','postulacion_y'],axis='columns',inplace=True)

In [58]:
df_1['postulacion'] = pd.Categorical(df_1['postulacion'])
df_1['postulacion'] = df_1['postulacion'].cat.codes
df_1['postulacion'].value_counts()

1    6603752
0    4995382
Name: postulacion, dtype: int64

In [62]:
# Hasta aca Ya tenemos nuestro formato (id,postulante,aviso,postulacion)
df_1.head()

  idpostulante     idaviso  postulacion
0      0z5Dmrd  1112384041            1
1      0z5Dmrd  1112420060            1
2      0z5JW1r  1112257171            1
3      0z5JW1r  1112281879            1
4      0z5JW1r  1112292169            1

In [63]:
## Analizamos los avisos Detalle

In [59]:
avisos_detalle_df.merge(avisos_online_df,how='inner',on='idaviso').shape

(9627, 11)

In [60]:
avisos_detalle_df['idaviso'].unique().shape

(25288,)